#define _CRT_SECURE_NO_WARNINGS
//----------------------------------------------------
// 예제
//----------------------------------------------------
#if 0
#include <stdio.h>
int main(void)
{
	return 0;
}
#endif
//----------------------------------------------------
// 구조체 - 자가진단1
//----------------------------------------------------
#if 1
#include <stdio.h>
#include <string.h>
char words[21][21];
char letter[60];
struct stud
{
	char name[21];
	char school[21];
	char grade;
};
struct stud a;
void input(void);
int main(void)
{
	input();
	printf("Name : %s\n", a.name);
	printf("School : %s\n", a.school);
	printf("Grade : %d", a.grade-'0');
	return 0;
}
void input(void)
{
	int len;
	int wcnt = 0;
	int wlen = 0;
	fgets(letter, 60, stdin);
	len = strlen(letter);
	letter[len - 1] = '\0';
	len--;
	for (int i = 0; i < len; i++)
	{
		if ((letter[i] == ' ') || (letter[i] == '\0'))
		{
			wcnt++;
			wlen = 0;
		}
		else
		{
			words[wcnt][wlen] = letter[i];
			wlen++;
		}
	}
	strcpy(a.name, words[0]);
	strcpy(a.school, words[1]);
	a.grade = words[2][0];
}
#endif

//----------------------------------------------------
// 
//----------------------------------------------------
#if 0
#include <stdio.h>
int main(void)
{
	return 0;
}
#endif

//----------------------------------------------------
// 
//----------------------------------------------------
#if 0
#include <stdio.h>
int main(void)
{
	return 0;
}
#endif

//----------------------------------------------------
// 
//----------------------------------------------------
#if 0
#include <stdio.h>
int main(void)
{
	return 0;
}
#endif

//----------------------------------------------------
// 
//----------------------------------------------------
#if 0
#include <stdio.h>
int main(void)
{
	return 0;
}
#endif

//----------------------------------------------------
// 
//----------------------------------------------------
#if 0
#include <stdio.h>
int main(void)
{
	return 0;
}
#endif

//----------------------------------------------------
// 
//----------------------------------------------------
#if 0
#include <stdio.h>
int main(void)
{
	return 0;
}
#endif

//----------------------------------------------------
// 
//----------------------------------------------------
#if 0
#include <stdio.h>
int main(void)
{
	return 0;
}
#endif

//----------------------------------------------------
// 
//----------------------------------------------------
#if 0
#include <stdio.h>
int main(void)
{
	return 0;
}
#endif

//----------------------------------------------------
// 
//----------------------------------------------------
#if 0
#include <stdio.h>
int main(void)
{
	return 0;
}
#endif

//----------------------------------------------------
// 
//----------------------------------------------------
#if 0
#include <stdio.h>
int main(void)
{
	return 0;
}
#endif

//----------------------------------------------------
// 
//----------------------------------------------------
#if 0
#include <stdio.h>
int main(void)
{
	return 0;
}
#endif

//----------------------------------------------------
// 
//----------------------------------------------------
#if 0
#include <stdio.h>
int main(void)
{
	return 0;
}
#endif

//----------------------------------------------------
// 
//----------------------------------------------------
#if 0
#include <stdio.h>
int main(void)
{
	return 0;
}
#endif

//----------------------------------------------------
// 
//----------------------------------------------------
#if 0
#include <stdio.h>
int main(void)
{
	return 0;
}
#endif

//----------------------------------------------------
// 
//----------------------------------------------------
#if 0
#include <stdio.h>
int main(void)
{
	return 0;
}
#endif


//----------------------------------------------------
// 
//----------------------------------------------------
#if 0
#include <stdio.h>
int main(void)
{
	return 0;
}
#endif